acts
addressing
advance
burdens
businesses
changing
compete
comprehensive
comprehensive_tax_reform
destroying
economy
excessive
fairer
farmers
feed
focused
growth
individuals
january
jobs
keeping
large
manufacturers
needed
overturning
owners
passing
paycheck
privilege
products
reducing
regulatory
regulatory_burdens
ridiculous
signed
significant
significant_progress
skills
small-business_owners
solutions
stalling
survive
workers
workforce
accidents
acquire
acres
acute
administrative
appalling
areas
assistance
atrocious
avert
aviation
bays
beautiful
birds
black
carefully
channels
commitments
conditions
considerable
consistent
constitute
construction
cop
courses
cove
craft
create
crossing
crumbling
daily
dangerous
demanding
developments
diligently
domain
don
dutifully
elevated
embarking
emergency
enhance
environmental
equally
evacuations
evaluations
events
exchanges
expanding
expenses
exploded
facilities
families
fancy
fast
fearful
fields
fifty
fleeing
flights
freezing
furious
generally
generating
genuine
giant
glory
goals
grabbing
gradually
gravel
greedy
grief
grounds
halting
hampered
harbors
hardening
hardships
harsh
hastily
havoc
hazards
healing
helpful
hindering
historically
hospitals
impeded
implementing
improvements
include
increasingly
indefinitely
infrastructure
inhabitants
interrupted
isolating
jeopardy
journeys
jumped
justifying
keen
key
killing
king
king_cove
knowledge
lacks
lament
landscapes
lane
lanes
liberals
limited
linking
localities
lofty
losing
mainland
mandatory
masterful
medical
miraculous
moves
narrow
nasty
native
navigable
needless
neighborhoods
networks
nineteen
opening
opportunities
optimal
options
outlined
outs
panels
path
patiently
patients
paved
peacefully
peninsula
population
postpone
practice
praying
preferred
preserve
prioritize
protecting
quality
quickly
quietly
rapid
refuge
reliably
requisite
resilient
resolutions
ride
roads
rough
routes
routinely
ryan
safety
sanctuary
saves
saving
sections
segments
seventy
sheltered
situations
society
stationed
street
subvert
temperatures
terrifying
threatening
towns
travels
traverse
treacherous
unbelievably
unique
unjust
unreliable
urgently
vanity
venture
vibrant
victory
ways
weather
weigh
wild
wilderness
willfully
wins
winter
wishes
wo
wrongdoing
yeah
yearning
yelling
zinke
zoom
30-foot
ability
accepted
anchorage
arrive
bay
blowing
boat
built
bus
ca
calls
caught
clinton
clinton_administration
cold
covered
crab
crashed
died
edge
elders
evacuated
exchange
experience
fly
generation
goose
harm
helicopter
hospital
hurt
interests
ironic
lady
lagoon
levee
miles
military
military_base
mistake
phone
phone_calls
positive
pot
recommendations
refusal
requested
settled
solution
suggesting
supply
tourists
waves
wildlife
wildlife_service
winds
addition
alaskan
alternatives
analysis
analyze
authorization
authorized
based
bears
benefits
bridges
careful
caribou
chain
conducted
consequences
conservation
contents
contingent
costs
damage
decision
delegation
designated
determination
determine
determined
dredge
ecosystem
environmental_review
eventual
existed
extensive
global
habitat
homework
ignorance
ignore
impact
impacts
improve
informed
informed_decision
inside
installation
international
irreplaceable
islands
justified
knowing
lengthy
management
management_act
mandate
merits
migratory
obligations
opposed
opposition
pacific
pages
pipes
populations
preparing
prime
professionals
providing
ram
reviewed
scientific
sounds
species
spite
supports
trail
transportation
treaty
ultimately
unintended
viable
waterfowl
weighed
wetlands
wildlife_refuge
woods
adjacent
ailing
ambulance
argue
arrived
blizzard
brave
choices
connected
cutting
decades
dire
dock
don_young
early
emergencies
emergency_services
enormous
expedient
ferry
fishing
fortunately
granted
inaction
journey
lived
lucky
perilous
perish
perished
planes
pressing
pressing_issue
pulled
quote
region
rescue
rope
runway
safely
scenario
sea
seas
shameful
stayed
storm
storms
strongly
supplies
tireless
tireless_work
travel
unable
added
aerial
affairs
approving
authorizes
average
cancellation
commonsense
commonsense_bill
communities
connecting
critical
dependable
deserve
environment
expectation
factors
fundamental
fundamental_right
healthcare
importantly
indians
introduced
justice
lifesaving
lifesaving_care
link
living
much-needed_legislation
multiple
oceans
parties
permanent
prevents
receive
required
results
rights
routine
sponsoring
stated
supporters
surrounding
surrounding_areas
taxpayer
taxpayer_money
testified
tribal
tribal_members
tribe
asia
awaiting
backbone
borough
capability
capacity
commercial
companies
company
convincing
debating
east
emergency_situations
emphasize
enabling
enforce
evidence
freight
fresh
goods
hub
impossible
included
incredibly
isolated
japanese
movement
objective
operated
pan
participated
peter
pointing
police
presented
processing
prohibition
purpose
purposes
reasons
remote
repeatedly
resources
seafood
seeking
socioeconomic
sold
storage
subsidiary
vision
walker
accommodate
activists
adoption
barriers
begged
bureaucracy
civilization
commerce
decade
desperately
evacuation
exceptionally
extended
facilitates
financing
forbid
helps
ideological
interstate
involved
involvement
landing
leftwing
medical_facilities
natural
neighboring
overdue
parkway
patient
permission
persistent
pointed
potentially
prevented
preventing
prosperity
pursuit
recurring
regional
resident
route
salute
sampling
seventies
sounded
speedy
struggling
struggling_families
stymied
suffering
sustaining
theme
tiny
trouble
waiting
westerman
army
army_corps
capable
corps
directly
engineers
funded
ice
identified
invested
marine
published
reliable
supporting
trip
acknowledge
acting
acting_attorney_general
apparent
attempts
bipartisanship
candidate
carrying
congressionally
direction
emails
enable
fbi
fbi_director
fired
flynn
focus
interfere
interview
investigation
learn
lots
oppose
paying
potential
precedent
readily
russia
russia_investigation
russian
russian_government
sanctions
shifts
showing
threatened
ties
vital
weakness
abandon
accusations
accustomed
animal
appropriated
assessed
beneath
buy
challenges
choose
conclusion
convinced
differences
dollars
falling
faster
findings
frontier
fully
hang
human
human_life
irresponsible
legitimate
millions
proposal
protects
rely
rhetoric
safety_concerns
sky
stake
surely
tens
throwing
tribal_communities
worthwhile
1990s
accident
advantage
alaskans
alternative
anguish
attack
audacity
cases
chose
constructed
decide
earn
emotional
engaged
exists
exorbitant
expensive
extracted
flat
forcing
heaven
heck
ideology
irrational
masses
medical_care
medical_needs
nepa
nepa_process
overwhelming
overwhelming_majority
philosophical
realize
recreation
silly
someplace
specifically
spend
study
stupid
superior
traced
4-year
approved
commonsense_amendment
concluded
condition
exceptions
minimized
mitigation
notable
project
removal
requiring
restores
sensitive
straightforward
transparent
mitigate
opening_statement
pushed
secretaries
unnecessary
wholly
abundance
bestow
damaged
debated
degradation
diversity
ecological
federally
fragile
globally
irreparable
irreparable_harm
lands
landscape
level
managed
negative
offset
operation
protected
protection
received
register
seeks
shows
steps
stewards
wildlife_habitat
administrations
allowing
deals
expected
respectfully
sally
stress
unfavorable
blm
caused
controlled
depending
distance
eighty
eighty_percent
groups
inch
lung
solving
tolerate
whatsoever
aspects
completed
consuming
delays
fought
killed
makes
recently
slowed
waives
clean
correction
expands
input
permits
technical
technical_correction
water
worse
acknowledging
cargo
carried
cuts
designed
education
equipment
extreme
funding
intended
market
massive
medicaid
medicare
operating
passengers
performing
provided
purchase
reimbursed
repay
risk
sell
spending
stopped
taxpayers
thankfully
authorize
awarded
charging
constructing
costly
failures
governments
hurricane
hurricane_katrina
katrina
largely
levees
mechanical
new_orleans
orleans
penalize
punitive
puts
repayment
tag
targets
temporary
bore
decisions
faulty
mandated
mandates
accurate
alluded
bishop
broke
cute
force
forced
gotcha
grants
maintain
poorly
promised
reality
sincere
stuck
unlike
wildfires
abdicated
accomplishes
accomplishment
accountable
achieve
adversaries
agile
altered
apparatus
arise
array
attacks
authorities
authorization_act
backing
beginning
bolster
border
brady
calling
carry
ceded
components
conferees
confirming
consolidating
constantly
constitution
copy
created
creates
crimes
cyber
cyber_warfare
daily_basis
dangers
defenders
deny
departure
detection
dhs
diminished
disasters
discretion
disrupt
drug
drug_smugglers
duty
efficiencies
efficiency
eliminating
emerging
emerging_threats
encourage
enemies
enjoys
entry
evolving
expand
expeditiously
explosive
facing
fight
frontline
funds
gathering
human_traffickers
human_trafficking
identifying
improves
investigations
jurisdiction
jurisdictional
kelly
kevin
kevin_brady
latest
laws
letters
mccaul
measures
michael_mccaul
mission
modernize
mou
natural_disasters
newspaper
nimble
offices
op
outdated
pick
plot
programs
push
qualified
ran
readiness
reauthorization
reauthorized
recruiting
referral
relentlessly
reminded
replace
requests
reserves
responders
response
robust
robust_oversight
sacred
sequential
shared
signing
sincerely
smugglers
smuggling
standards
stating
streamlining
strengthen
technology
terror
terror_attacks
terrorist
terrorists
testimony
threat
threats
tools
traffickers
trafficking
training
tsa
tv
unacceptable
understanding
values
vessels
warfare
waste
weapons
writing
acquisition
activities
additionally
bags
blocks
bolstering
buildings
centers
communications
containers
counterterrorism
customs
cybersecurity
donald
donald_trump
drugs
employee
enforcement
engagement
exercises
exhaustive
exit
expects
fusion
improving
initiative
integration
intrusions
investments
jurisdictions
levels
liberties
maritime
nonprofit
operations
physical
policies
policymaking
pounds
protections
protective
rail
range
rejects
removes
responder
safeguard
screens
securing
sharing
smart
smart_investments
staffing
stakeholder
thrust
transit
truck
vehicles
visit
visiting
warnings
armed
armed_services
authorizations
century
congratulate
disaster
emergency_management_agency
energy
extremely
fema
includes
marked
matters
missions
parity
preparedness
priorities
reauthorizations
redundant
related
retirement
thompson
unmanned
variety
waters
achieved
analysts
capabilities
cities
competitive
core
courageous
deadliest
destination
developed
firsthand
fusion_centers
gains
identify
initially
injured
inspired
isis
led
maintained
network
orlando
perpetrator
police_chief
responded
saved
scene
severely
successful
supported
visitors
acknowledged
airports
arkansas
assess
attempting
backwards
capacities
checkpoints
contradict
contravention
coverage
defense
demands
division
duties
elimination
evaluate
explicitly
formula
fy
gather
increasing
independent
lone
middle
monitor
municipality
new_york_city
officers
partner
partners
passenger
primary
primary_responsibility
problematic
processes
requirement
responsibilities
responsible
sends
share
shifted
statutory
terrorism
transitioning
traveling
traveling_public
wolf
authorizing
cabinet
collaboration
committees
component
contributed
crucial
demonstrates
departments
disposal
diverse
ensuring
fulfill
fulfilling
functions
greatly
immigration
immigration_laws
integrity
judiciary
judiciary_committee
longtime
oliver
performed
promise
reauthorize
refugee
reported
restoration
tool
uscis
utilize
adopting
beach
borders
compromised
crossings
efficient
gaps
increase
increased
increased_funding
innovative
invest
lax
los_angeles
ports
projects
reimburse
secure
casualty
chiefs
commissioner
cybersecurity_threats
destinations
developing
emergency_preparedness
enhanced
ensures
equipped
essential
europe
expressed
fiscally
funding_levels
helping
historic
iconic
international_association
interoperable
investment
landmarks
mayors
measuring
new_york
ny
nypd
police_department
practices
prepare
priority
reauthorizes
recipients
recruit
remains
returns
safest
sheriffs
steadfast
target
taxpayer_dollars
title
title_vi
tourist
willingness
york_city
adviser
barletta
codify
coordination
disabilities
disability
division_f
integrated
management_practices
appreciation
appreciative
aspirations
backdrop
carol
defined
directs
equality
fairness
heinous
hernandez
individual
individual_liberty
liberty
louis
owe
personally
singular
thrive
transportation_security_administration
tsos
adds
adjustments
agreements
analyst
applied
assurance
assures
authorization_bill
aware
binding
bless
border_security
calculated
chemical
codified
comprehensive_immigration_reform
consequence
consortium
coordinator
core_mission
defending
deport
deporting
dhs_office
directive
domestic
drills
emergency_response
employees
entities
environments
envisioned
established
establishes
establishing
evolved
existence
facility
feedback
forever
forget
hate
heroism
host
hurricane_sandy
implement
importance
inclusion
initial
injuries
inspector
jackson_lee
leads
learned
legally
lessons
liaison
lines
locals
messages
methods
metrics
minimize
morale
multiyear
nature
non-
november
ongoing
outreach
overcome
overcoming
pace
participation
partnership
performance
perpetrating
planning
plays
practicable
purchases
raid
recall
reckless
recognizes
recovery
reduce
relationship
reminds
reporting
resource
responding
resulted
sacrifice
sandy
sang
scenarios
september
serves
settings
shooting
significant_role
strategy
taxes
territorial
terrorist_attacks
train
transparency
transportation_security
vulnerability
amends
armed_forces
broader
clarifies
combination
critical_role
dave
defazio
discussions
forces
garamendi
hearings
industries
moved
multitude
overseeing
regulated
regulatory_relief
servicemembers
shuster
updates
advancing
assignment
broaden
drug_enforcement_administration
effectively
encourages
expertise
gaining
marine_corps
sponsored
strengthening
undertaking
5-year
active
administrator
bolsters
canines
continuity
critical_piece
deployment
enhances
explosives
lasting
measurable
oversee
prioritizing
procurement
relating
screening
sectors
shooters
surface
systems
technologies
vetting
affects
boots
child
customs_enforcement
guidance
holds
honored
illegal
illegal_immigration
inefficiencies
leading
much-
offers
original
original_cosponsor
rapidly
treasure
consolidation
cyber_attacks
faced
faces
islamist
mounting
operational
promotes
reports
surges
unsecured
assets
demonstrate
efficiently
focusing
participate
positions
relates
salary
strategic
strategic_plan
tail
teeth
complete
federation
federations
jewish
jewish_federations
subsequent
unanimously
115th
115th_congress
affecting
altering
bill_shuster
bob_goodlatte
chaffetz
chairs
clause
clearing
cohen
construed
coordinate
devin
devin_nunes
dispute
exercising
expedite
expiring
goodlatte
heartfelt
implementation
jason
jennifer
jointly
lamar
markups
maximum
nunes
permanent_select_committee
preclude
principles
produce
recording
resolve
revenue
science
sequential_referral
team
team_effort
timely
tirelessly
unauthorized
walden
accompanying
bureaucratic
cooperation
dated
discussed
foregoing
governance
growing
growing_threats
july
jurisdictional_interest
listed
referenced
reforms
reiterate
waive
abundant
brings
careers
creators
employed
highlight
industry
innovation
manufactured
manufacturing
materials
percentage
perseverance
promoting
raw
stronger
technicians
thriving
to-
trillion
twenty
barry
brain
cancer
cellphone
hero
honesty
human_being
john_mccain
nice
notice
pleasant
prayers
presidency
produced
produces
saddened
shooter
speaking
standing
vietnam
voice
voices
assisted
bright
celebrating
countless
dealing
drivers
firefighters
medical_personnel
memories
recognizing
spots
suffered
tragedy
trauma
twelve
zone
10-year
advocacy
advocating
charleston
constituent
customer
disabled
dogs
educate
elderly
elizabeth
elliot
embodied
field
frequently
greg
ideals
institute
nursing
operates
owner
prestigious
professional
providers
ranked
reflects
rehabilitation
research
resides
satisfaction
selected
seniors
skilled
thanking
west_virginia
activity
alexander_hamilton
announce
cents
considers
dead
deduction
destruction
disparity
donor
earned
examine
exclusion
federalist
federalist_papers
formation
hamilton
new_jersey
overhaul
papers
payer
stream
taxation
tremendous
angela
balart
completing
congratulations
consummate
degree
democracy
deserving
diaz
exemplify
fighting
grace
hispanic
hopkins
human_rights
johns
lincoln
master
miami
named
places
ramirez
ranks
selflessly
staffers
starting
university
15-year
additions
advised
announced
appropriations
appropriations_act
appropriations_package
arbitration
bravely
cap
cfpb
complete_list
constitutional
constitutional_duty
consumers
disapprove
expense
frelinghuysen
gi
highlighting
hurts
increases
items
lawyers
learning
lifelong
misguided
models
notify
online
overturn
phil
phil_roe
postponed
raise
regulation
remove
rodney
rodney_frelinghuysen
roe
schedule
suspension
suspensions
troops
uphold
va
veterans
vets
wall
appropriations_bills
appropriations_committee
assume
bringing
covers
discretionary
discretionary_spending
minibus
ndaa
noted
structured
structured_rule
timeline
breaks
congresses
observation
sequester
suspected
unusual
barack
barack_obama
campaigned
chuck
chuck_schumer
hillary
hillary_clinton
joe_biden
adopted
assumed
assure
billions
border_wall
effective
effective_way
engage
position
presumption
books
challenge
dams
fence
majorities
nationally
proof
quoting
reading
sixty
thankful
upset
billion
burdensome
burdensome_regulations
carrier
compliance
compliance_costs
constitutional_authority
implemented
imposed
motor
ominous
overly
overregulation
paperwork
parameters
patchwork
regulatory_costs
resisting
restore
restriction
stringent
trend
truckers
trucking
victim
waning
waning_days
cook_county
counties
fell
filling
fox
grove
impressive
lake
lent
mchenry
municipal
municipal_employees
neighbors
rains
sand
volunteers
witness
academically
adult
andrea
associate
attending
baptist
baptist_church
bernice
christian
college
congregation
congregations
convention
divinity
doctor
excelled
gang
gang_violence
greenville
honorary
honoring
howard
humanity
impacted
located
mankind
married
missionary
north_carolina
parents
pastor
positively
pulpit
receiving
represents
retire
reverend
ruby
salem
shaw
shaw_university
stretched
violence
wake
wide
winston
agricultural
agriculture
bowl
card
comprehensive_package
critically
deportation
dinner
farms
farmworkers
food
founded
incorporated
intensive
jump
negotiated
partially
permanent_residence
residence
salad
shadows
tables
the_central_coast
undertake
undocumented
worker
1900s
absolute
acceptance
accuracy
active_duty
affordable
affordable_healthcare
answers
anthem
anymore
appealing
appears
arthur
aspect
attacked
attractive
ayatollah
begging
beirut
benning
blind
bluff
boats
boehner
bothers
bureaucrats
buying
capitalism
carter
cash
catastrophic
cbo
centuries
ceos
charge
cheap
china
chooses
circulating
clinic
closer
competition
completely
concerned
continues
contrary
copyrights
corporate
corporate_tax
corporations
creating
crony
cured
cures
customers
deductible
degrees
depends
desantis
despise
detroit
devastating
diagnosis
difference
differently
disease
diseases
doctors
driving
dying
easily
east_texas
embassy
embrace
emergency_room
emergency_rooms
empires
employer
endorse
enforced
enhancing
entity
entrepreneurs
estimated
estimates
exemption
experiencing
explode
expressly
eye
figure
finding
fingers
footing
fort
fortune
founders
freedoms
gee
goodness
gosh
government-
hailed
harry
harry_reid
hateful
healthcare_providers
healthcare_system
hip
historian
historians
historical
hit
homeless
hoping
horror
hostages
human_history
ignorant
illegally
incentive
innovate
insidious
insurance
insurance_companies
insurance_company
insurance_plans
insurance_policy
insurers
interpretation
interpreted
intimidate
iran
iranians
it--
jesus
knee
korea
lifesaving_medications
lifetimes
lifted
loses
louie
manufacture
marines
market_system
masks
mayo
meant
medication
medications
medicine
midwestern
minority
minus
model
modern
monopoly
mount
north_korea
numbers
nurse
nurses
obamacare
occurred
official
opposing
orchestrated
orderly
originally
oval
oval_office
overnight
panacea
passes
patents
pays
peace
pharmaceuticals
physician
physicians
pie
plans
politicians
polls
poor
possibly
precious
precious_lives
premise
premiums
pressure
prices
private
procedures
profits
properly
protocols
pulling
raised
recorded
refusing
repealed
repealing
researched
rewarding
rid
ron
roof
rooms
rumors
satisfied
savings
savings_account
schemes
score
scoring
shortly
shoved
skeptical
skewed
socialized
socialized_medicine
southeast
southeast_asia
spur
stick
sticking
students
subsidy
successfully
supplemental
surgeries
surgery
survives
tactics
tehran
terrorist_attack
thoughts
throat
tiger
totalitarian
transition
treatments
trillion_dollars
turns
tyrant
tyrants
undercut
unions
unrealistic
valuable
violate
wars
weekend
wisely
worded
works
worry
worthless
wreaking
2016_elections
2016_presidential_election
abuses
adoptions
agents
aligned
allowed
amazing
answered
appeared
appointed
approval
approve
asset
asset_forfeiture
atrocity
background
beaten
beneficiary
briefings
buddies
caliber
carriers
christopher
christopher_steele
claimed
client
clintons
cnn
colluded
collusion
comey
communication
communications_act
communists
computer
confused
consulted
contacts
controlling
debunked
deciding
deleted
denied
dirt
disclosures
documentary
dossier
drew
effects
electronically
encounter
ends
equation
era
essentially
fcc
film
firm
fisa
fisa_court
forfeiture
fusion_gps
garbage
gps
grip
guest
gun
hacked
hacking
hat
hey
hired
holdings
hosting
human_rights_abuses
independent_counsel
indication
infamous
inherently
inquiry
investigate
involving
jailed
james_comey
janet
judge
justice_department
leaking
leaning
letting
lied
listened
lobbyist
loretta
loretta_lynch
lured
lynch
magnitsky
mainstream
mainstream_media
maureen
meaning
meantime
media
mess
moscow
mueller
napolitano
narrative
negative_effects
net
net_neutrality
neutrality
october
older
opponent
orwellian
parole
patriot
perfectly
permitted
play
playbook
preparation
presence
preserving
presidential
previously
progressive
promptly
proponents
putin
realized
recused
refused
regime
registration
regulate
relationships
repeated
reportedly
representing
retaliated
row
rulemaking
rulemaking_process
russians
sanctioned
sergei
server
setting
size
smoking
socialism
socialists
sounding
source
sources
spectator
speed
spy
statute
steele
stolen
sued
supposedly
surveil
suspect
suspicion
tear
telephone
terrorist_organization
textbook
the_united_states_of_america
theft
timelines
trap
treated
trumps
understands
verizon
visa
watch
wealthy
web
wikileaks
wire
wireless
yorker
diverting
dropping
exception
gutted
lucrative
obamacare_exchanges
restart
stalled
subsidies
aaron
affected
affected_areas
flooding
floods
heroes
hultgren
joined
lend
parts
professionalism
rising
roskam
scenes
stepped
strangers
unsung
unsung_heroes
battalion
camp
camp_lejeune
cornerstone
deployed
dietrich
elite
filled
gratitude
hole
honorably
leaves
lejeune
memory
middle_east
owes
preserved
remembering
richland
schmieman
selfless
sending
servicemen
yuma
aims
biggest
biggest_threat
bold
clean_air_act
climate
climate_change
congressmen
conservative
deeply
grijalva
harmful
huffman
introduce
lays
liberal
lift
pipelines
planet
polis
pollutants
preservation
pushing
renewable
renewable_energy
roadmap
ronald_reagan
skies
smoggy
undermine
aloha
armed_services_committee
commemorating
committed
creative
erik
helping_hand
kids
laugh
legislature
matthew
naomi
partnerships
passion
pictures
sami
advocates
associates
blair
brink
bucks
bucks_county
candace
clarke
colleen
conscience
conviction
decent
dignity
driven
durable
empower
florence
grateful
homes
housing
josh
karen
laura
leonard
living_conditions
locally
motivated
mulvaney
sam
shelter
substandard
susan
theresa
tracy
worldwide
aca
and-
avoidable
deaths
insurer
marketplace
rates
replacement
shot
skyrocketing
trumpcare
uninsured
dean
gibbs
interested
organizing
participating
player
ralph
ralph_regula
regula
classroom
contributing
cultivate
donating
educational
educators
excited
experts
farmer
gainesville
gardens
gdp
generosity
grows
launched
positive_difference
schools
workshops
anticipated
damaging
email
headlines
independent_commission
influence
kremlin
nominee
series
spelled
breaking
closing
computer_science
developers
doors
false
fewer
gap
gender
girl
girls
graduates
highly
invests
playing
playing_field
software
teaching
actions
addiction
adequately
alive
ambushed
anger
apartment
applaud
assassinated
assault
authentic
backs
balances
believed
believing
blamed
blanket
blend
blessing
blood
brand
bronx
brooklyn
cared
celebrate
celebrated
challenging
circumstances
civility
civilized
cold_blood
combine
comfort
condolences
continually
cops
counselor
courage
coward
crazy
crime
criticism
daughters
davidson
decorations
define
demonize
demonstrations
deranged
detective
detectives
devotion
dishonor
distances
dreams
drive
embraced
emerged
enforcement_officers
epitomized
explaining
fabric
fade
familia
fantastic
favorite
female
finds
flagged
forged
fortunate
friendships
funeral
gathered
glue
grade
guys
handful
harris
hated
hearts
heights
hopes
illness
incredible
indefensible
independence
inherent
joel
killer
knife
lightly
lights
liu
match
miosotis
mom
moments
mourn
murdered
newspapers
obligation
occupation
outrage
outraged
parent
played
plaza
pledge
police_officer
police_officers
policing
positive_changes
possibility
powerful
precinct
prison
promote
race
ramos
referee
religion
renewed
represented
respecting
retreat
rev
risks
rivera
runs
scared
sells
senseless
sharp
shoot
siblings
sister
sisters
smile
societal
solace
solely
solve
spike
stands
starts
streets
strive
surrounded
takes
targeted
teach
television
torn
touched
toxic
transformed
traveled
trooper
uniformed
unnoticed
unquestionably
upstate
upstate_new_york
vain
valentine
vilified
vow
vowed
walk
washington_heights
wearing
worship
yorkers
youngest
bodily
dark
delivered
enforcement_personnel
gunshot
hostile
indifferent
joins
killings
neighborhood
oldest
recollection
refuse
remarked
robbed
sadly
swore
brad
ceo
certainty
clarity
eligibility
executives
failure
leaving
materially
partisanship
permanently
pragmatic
premium
raising
reductions
shield
stability
stabilize
uncertainty
ear
highways
pieces
pipeline
reads
resounding
sentence
shout
shy
arguments
canada
locality
loser
the_gentleman
-women
abuse
anxiety
badges
brave_men
brooks
combined
consultation
depression
disorder
disorders
divorce
doj
encounters
enforcement_agencies
gunfire
illnesses
introducing
lingering
mentoring
occupational
oriented
peer
pilot
pilot_programs
policemen
post-
preventative
psychological
severe
shift
stakes
suicide
suicides
toll
traumatic
unseen
voting
wellness
accreditation
addresses
approaches
assessments
atmosphere
avenue
bernardino
chilling
churches
civilians
collaborating
collectively
comfortable
comprehensive_approach
concert
cooperate
cosponsors
countless_others
criminal
crises
crisis
culture
dallas
deadly
deescalation
demings
depth
detentions
distinctive
efficacy
enactment
endorsed
enforcement_agency
enforcement_officer
exceptional
experienced
focuses
freddie
frightened
gray
gunman
gunned
heads
hometown
horrendous
horrific
houston
incidents
injustice
innocent
internal
investigating
investigative
issued
kills
las
las_vegas
longstanding
massacre
medallion
memorial
memorialized
mindset
misconduct
modern_history
nationwide
nightclub
noteworthy
occurrences
paramount
pastors
pedestrian
posed
pregnant
prevalence
primarily
privacy
procedure
professional_career
prosecution
prosecutor
publicity
pulse
pulse_nightclub
questions
reduced
relations
returned
rice
rights_division
sadness
safety_officers
springs
stops
stressful
studies
substantive
sunday
survivors
sutherland
sutherland_springs
sync
tamir
tamir_rice
task
task_force
texans
thanksgiving
therapies
tragedies
tribal_governments
undertaken
unfortunate
units
val
vegas
violation
wounded
wounding
alliance
boone
chances
clinicians
comparison
cope
counseling
double
enforcement_community
experiences
felons
indianapolis
joining
leading_voice
murder
nielsen
pilot_program
pleaded
psychologists
ptsd
publicly
recognized
referrals
sheriff
silence
strains
struggles
suicide_rate
symptoms
tremendous_work
trials
types
unthinkable
veterans_administration
violent
fooled
fraternal
fraternal_order
graphic
patrol
professions
split
susan_brooks
thin
thin_blue_line
allowable
civilian
defense_department
deserves
difficulties
establishment
fatality
finest
horrible
initiate
resulting
veterans_affairs
advanced
advanced_technology
attorneys
benevolent
booth
consistently
doug
doug_collins
grow
handle
hostage
injury
life-
military_forces
original_sponsor
post-traumatic_stress
reichert
sergeants
stresses
struggle
suicidal
badge
beat
connection
discussing
post-traumatic_stress_disorder
stigma
tragically
astute
circumstance
congresswomen
endure
enormously
impactful
conjunction
directed
epidemic
firearm
gun_violence
human_services
immune
incorporating
proposing
reflecting
retired
cannabis
chemicals
compared
dea
endangered
enjoy
eradicate
eradicated
eradication
harvest
marijuana
plants
poured
property
raids
seized
severity
sites
stuff
thinning
timber
water_quality
beneficiaries
bigger
bigger_paychecks
claims
deductions
deficit
deficits
endless
global_marketplace
halloween
hawk
hoyer
income
losses
low-
mask
middle-income_families
middle_class
mnuchin
notion
passthrough
paychecks
relevant
rich
rich_people
risky
tremendously
unpaid
upper
amounts
ample
ample_time
arcane
automatic
averages
beast
blind_eye
bracket
burden
capping
cetera
classes
cohesive
constructive
corporation
credits
dangerous_bill
dangerous_precedent
dastardly
deductibility
dental
details
disproportionately
divided
double_taxation
drilling
economists
equity
estate
estimate
expert
expert_witnesses
factually
financial
financial_burden
flawed
forums
fundamentally
gift
hardship
imposing
income_taxes
inequity
irresponsibility
jammed
lakes
lamented
larson
liability
lies
lowering
mechanism
minimal
moderate
modern_times
neal
neutral
northeast
paygo
perspective
pit
professed
property_tax
proportion
proposals
recession
reconciliation
reduction
regions
regressive
replacing
rush
rushed
sequestration
shell
staggering
starve
stimulus
stubborn
student
student_loan_interest
subsidizing
suggests
sullivan
tip
trigger
triggers
troubling
unaffordable
unfairness
unfunded
wage
wealthiest
wealthiest_1_percent
west_coast
win
windfall
winning
witnesses
wondered
younger
borrowed
indebted
substantially
timeframe
abandoning
abroad
adding
addressed
admitted
adverse
adverse_effects
authors
balanced
balanced_budgets
borrow
borrowing
budgets
calculations
capital
chicago
cited
compelling
concessions
confidence
contemplated
counting
credibility
currency
dan
decline
deduct
defense_spending
demanded
destabilization
deterioration
districts
domestic_product
donors
dozens
dynamics
employment
enterprises
enthusiastically
escalation
evaluation
eventually
exacerbating
fallacy
farther
finance
finance_committee
flawed_bill
geopolitical
goldman
goldman_sachs
growth_rate
hopeless
households
impassioned
imperative
improved
increased_risk
inevitable
ironically
justify
leg
lifting
limits
locate
markets
mccarthy
middle_class_families
middle_class_households
mitigating
negatively
nonpartisan
officials
opposite
outlook
output
penalizing
penn
polite
posture
presided
pressured
private_investment
prominent
quantify
ratio
ratios
reflection
reins
released
resilience
respects
rises
roughly
rubin
sachs
scam
sector
spreads
substantial
sufficiently
surpluses
talks
threaten
trajectory
treasury
unpredictable
unsound
unsustainable
urged
views
virtually
wealthy_individuals
wharton
widening
worsening
worthy
achieves
adhere
adversely
affordable_care_act
assertion
average_family
average_tax_cut
bankrupt
biomedical
biomedical_research
blame
bulk
capital_markets
chart
charts
choosing
competence
conscientious
controversial
correctly
creator
criteria
dangerously
describe
dismissed
domestically
doubled
doubling
dramatic
drop
duration
education_system
expansion
expediency
explodes
gop
gop_tax_scam
gulf
heap
highlighted
hike
honestly
immoral
income_level
intellectually
intention
internationally
jobs_bill
kick
large_businesses
layers
laying
medium
middle_america
mirror
optimistic
perpetuating
perverse
precisely
presume
projecting
promises
pursue
rationale
reached
referred
repeating
rob
rostrum
sake
scores
separate
showed
shrink
sink
sized
souls
speeches
structure
struggling_americans
suppose
sustainability
technically
thoughtful
threatens
undermining
vague
vastly
versus
vetted
wider
anna
bradford
championship
coaches
describes
evan
hayden
madison
playoffs
samantha
schultz
sets
stars
swept
volleyball
won
emailed
fatally
fears
financial_hardship
franklin
medical_expenses
professor
property_taxes
tuition
waivers
worried
adventure
annually
application
articles
arts
avid
charlie
christine
climbing
continents
demonstrated
designate
designation
entrepreneur
exploring
fitting
fitting_tribute
guide
installing
literacy
magazines
miguel
miriam
mountain
mountains
naming
nonprofit_organizations
outdoors
peak
philanthropic
photographer
photographs
province
skill
southwest
spaces
sport
treasured
unnamed
walls
accomplishments
climb
enduring
legacies
names
renaming
rock
tibetan
11th
alzheimer
campbell
caring
carolinians
carroll
diagnosed
dimes
global_war
instrumental
iris
lexington
sons
south_carolina
trustees
achievement
athletic
bobby
burns
coach
consecutive
endeavors
fans
flying
football
horses
inspiration
lancaster
legends
players
seasons
sportsmanship
troy
undefeated
-the
abraham
actively
advocated
affidavit
aids
alike
apology
apparently
applies
apply
appropriation
approximately
arrogance
austria
aviv
background_check
background_checks
backgrounds
banking
banks
battle
beating
beliefs
biblical
birth
blocked
bombs
boot
branches
buried
cal
checks
chinese
christians
christmas
churchill
clients
college_student
communism
communist
complain
consumer
convictions
corporate_america
corporate_tax_rate
countries
credit
cultivated
curve
deductibles
delegates
denials
dependence
destroyed
divine
dragging
dreamed
dropped
early_days
echo
economically
eighties
embarrassment
enables
encouraged
entrenched
eu
experiment
explained
fails
fallen
farmed
feelings
felony
felony_judge
flaws
flooded
flourishing
flowing
foolish
germany
goal
greed
guns
hammer
harder
heading
hebron
hits
icbm
improper
inaccurate
income_tax
individual_mandate
ineligible
ireland
isaac
israel
israeli
jacob
jerusalem
jesse
judicial
kicked
korean
lasted
loans
lure
manufacturing_jobs
maximize
mentality
merry
minded
miracles
mob
moore
nations
nics
nose
nuclear
nuclear_weapons
orders
outrageous
paradise
parenthood
pence
perfection
perpetual
pilgrims
planned
planned_parenthood
plenty
poland
polish
politically
poorest
pope
premier
presidents
principle
prisoners
private_insurance
probable
probable_cause
producing
professors
prosecuted
prove
providence
ravages
rebuild
rebuilding
reciprocity
records
reining
replete
revolutionary
revolutionary_war
rewards
richest
richest_americans
rubber
ruin
ruled
ruler
satellite
segment
shade
shocked
significantly
skin
socialist
solid
soviet
soviet_union
spreading
stalin
starvation
stepping
store
stores
stretch
studying
summer
sun
survival
swath
sweat
synagogue
taught
teachers
tel
tel_aviv
tells
terrified
testament
the_soviet_union
them--
these_united_states
thumbs
todd
tomb
totalitarian_government
totally
touted
trusted
twist
ukrainians
ultimate
unaccountable
unconstitutionally
undercuts
unheard
universities
unmitigated
wealth
whim
academic
academic_achievement
campus
catholic
compassion
deserved
doctoral
emphasis
exemplary
monsignor
positioning
prepared
remarkable
remarkable_career
south_florida
spiritual
st
tenure
well-deserved_retirement
antonio
athletes
athletics
boys
carries
champions
eagles
eden
finished
prairie
prevailed
rushing
scored
season
touchdown
yards
academy
allegheny
brian
brutally
deepest
deepest_sympathy
denying
expression
graduate
lisa
memorial_service
packed
respected
slippery
sympathy
tangible
township
turnout
universally
upheld
warm
willingly
admiration
agent
bones
broken
cartels
dressing
drug_cartels
empty
hitting
homicide
illegal_immigrants
illegals
immigrants
loss
manning
martinez
meal
outgunned
rocks
turkey
22nd
bronze
championships
competing
erin
games
gold
hails
hardworking
luck
male
medal
olympic
olympics
oneida
singles
south_korea
usa
wishing
driveway
owned
palazzo
parcel
park
park_service
seashore
vfw
vfw_post
114th
114th_congress
acreage
backyard
desirable
logical
parcels
30-year
barrier
bayou
beaches
cat
closely
draws
historic_sites
horn
mcclintock
natural_resources
noncontroversial
seymour
torres
basketball
bloomberg
brothers
category
collegiate
contribute
croix
donated
drafted
duncan
exemplifies
fame
hugo
hurricanes
hurricanes_maria
induction
irma
islanders
jody
maria
ncaa
olson
pools
staying
swimming
the_virgin_islands
tim
tony
virgin_islands
workshop
aggregate
carolyn
coalition
collapse
compromises
concrete
contained
contractor
cracking
departing
editorial
emotion
encouraging
eric
exposed
extending
foundations
halls
hartford
homeowner
homeowners
irs
journalism
koskinen
litigation
mixed
needed_relief
needle
north_central
organized
pouring
presenting
pyrrhotite
rallies
removing
repairs
reporter
ruling
sickening
staffer
substance
supplying
sylvia
treasury_department
unknowingly
unstable
wave
winston_churchill
appointing
awards
december
engineer
excellence
initiatives
larry
magazine
manager
officially
reorganize
shoes
eyes
grieve
recalled
scripture
sincerity
supervisor
teaches
terry
virtues
accordance
beauty
collected
electricity
endangered_species
facilitate
fees
gary
generate
heavy
heavy_lifting
herbert
juan
natural_resources_committee
new_mexico
paves
reclamation
rob_bishop
san_juan
strikes
tied
users
water_development
water_users
waterways
wyoming
approaching
autopilot
baby
balanced_budget
balancing
biggest_problem
blown
boomers
ceiling
courageous_leadership
critical_infrastructure
debilitating
demise
enemy
entering
entitlement
entitlement_programs
entitlement_reform
escalating
examples
futures
generational
horizon
hypothetical
insolvency
insolvent
instability
irrelevant
islamic
kicking
lion
looming
luxury
manageable
mandatory_spending
monthly
nearing
obstruction
pause
payroll
plate
probability
producers
prosperous
realistic
rein
revive
runaway
safety_net
safety_net_programs
sovereign
structural
suffer
urgency
vulnerable
warning
amplify
blessings
charitable
charitable_giving
charities
civic
collective
kicks
kindness
maintains
nonprofits
unites
affirmed
amended
appeals
casino
chumash
dismissal
employers
enrolled
entered
filed
gaming
gaming_regulatory_act
hotel
intends
lamalfa
placing
poverty
private_citizens
purchased
reaffirm
reference
reservation
santa
santa_barbara
suitable
tract
transferred
administratively
ancestral
attempted
descendants
desire
engaging
forthcoming
incorporate
lawsuits
persistence
reinforce
relation
resolved
shame
supervisors
1800s
arrival
carbajal
conducting
consensus
consists
culmination
decertification
europeans
fairly
overwhelming_support
partly
prosper
reaches
referencing
reside
salud
shortage
spanish
tribes
affirms
codifies
housing_crisis
maintaining
negotiations
outcome
prohibits
ratified
reaching
references
stakeholders
collaborative
documented
ensuing
incorporates
occasions
revenues
agreeing
antiquated
conaway
concession
discharge
enacted
ethnic
favorably
immense
jeffries
minorities
modernized
ordered
racial
statutes
updated
acceptable
african
allegiance
arctic
asian
bigotry
cfr
chabot
conscious
continuous
definition
demonstration
derogatory
disparaging
feels
flag
hakeem
hakeem_jeffries
indigenous
institutions
intolerance
islander
labels
modernizing
negro
offensive
origins
phrases
pledges
replaces
rooted
signals
terminology
unity
usda
valued
widely
characterized
cosponsorship
divisions
divisive
embedded
heal
meaningful
racially
symbol
advice
behavior
brave_women
coworkers
creed
disgusting
generations
granddaughters
grandsons
gynecologist
hallowed
hallowed_halls
harass
harassment
harshest
lasting_impact
obstetrician
perpetrate
practicing
predator
punishment
secrets
sexual
sexual_harassment
shining
shining_example
strongest
surround
unequivocal
unique_challenges
victims
workplace
wow
acquired
authored
collin_peterson
emmer
estates
exercise
holder
implements
lewis
mineral
mineral_rights
nolan
peterson
preexisting
private_land
superior_national_forest
undergone
chippewa
conveyance
downstream
exchanged
hunt
mining
minnesotans
ownership
perspectives
32-year
60-year
bomb
boundary
boundary_waters
canoe
chambers
continental
divide
epa
floating
flow
flows
involves
lakeshore
marks
misinformation
permitting
physically
pristine
rightfully
soil
sulfur
trade
appraisal
copper
courts
environmental_laws
fond
ignores
judicial_review
nickel
opposes
ore
outdoor
outdoor_recreation
raises
safeguards
suits
sulfide
undermines
destabilize
devastate
hikes
celebration
deported
detained
dream
dream_act
dreamers
engineering
implore
joy
minds
rutgers
accountants
administer
aging
agrees
amtrak
average_americans
bonanza
collection
college_education
corker
discover
enrich
exploit
false_promises
financed
gifts
holders
illustrates
incentives
infrastructure_investment
insecurity
insurance_market
insurance_premiums
kickback
likelihood
lobbyists
loopholes
nail
northwest
offshoring
overseas
pacific_northwest
phased
poised
privileged
remotely
satisfy
scrambling
simplification
tennessee
the_pacific_northwest
triggering
wondering
wreckage
blumenauer
clean_water
disturbing
drastically
drinking
earl
earl_blumenauer
element
hygiene
issuing
sanitation
cleveland
combat
commissioned
converted
crew
display
distinction
flagship
fleets
guided
littoral
missile
namesake
navy
newest
operate
shore
survivor
uss
drown
esteemed
excesses
golf
gop_tax_plan
jets
marched
millionaire
oligarchs
paint
pockets
railroads
state-
toilet
22nd_district
albany
childcare
dependent
february
incentivizing
medical_costs
mismanagement
overburdened
quo
salt
salt_deduction
typical
uphill
2000s
absurdity
abysmal
actuarial
analyses
angry
audience
baby_boomers
bailouts
baseline
blows
boards
brighter
brighter_future
cares
collapsing
concept
consumes
demographic
documentation
dramatically
elegant
elements
embracing
entitlements
expensing
expired
fascinating
fighting_chance
financially
forgive
frustrating
grind
gut
hallways
healthier
hemorrhaging
hiding
honorable
hundred
inability
income_inequality
inconsistency
inequality
intellectual
joke
math
microphone
microphones
modeling
observations
parks
paul_ryan
projected
projection
quarters
reelected
retiring
rewrite
rewriting
salaries
separation
skyrocket
slightly
slow
sorts
squeezed
stifles
stunning
subcommittees
surpass
terrific
thumb
uncomfortable
underfunded
video
volumes
wall_street_journal
wealthier
welfare
welfare_programs
window
wrenching
education_funding
eliminates
slashing
throws
benjamin
buck
cultures
elementary
explore
humanitarian
humanitarian_aid
literature
nobel
pearl
philippines
prize
remaining
remaining_time
thailand
vietnamese
bensalem
commonly
completion
decisionmaking
drug_abuse
educating
educational_programs
emt
gold_star_families
heroin
monument
opioid
resistance
alongside
cemetery
erected
groundbreaking
honorable_service
iwo
iwo_jima
jima
memorials
monuments
noble
recipient
sacrificed
surviving
ultimate_price
woody
dads
giveaways
middle_class_americans
moms
superwealthy
calvin
emphasized
exhibited
fondly
golden
greensboro
kathryn
naacp
nephew
roles
shined
sorely
spot
student_athletes
supporter
tourism
treasurer
awful
bed
brackets
christmas_eve
climbed
coat
corporate_taxes
cry
despair
dumping
eve
exemptions
fist
fool
grinch
handouts
household
hung
inches
jumping
load
loaded
loudly
meals
mouths
noise
paused
plane
postcard
practically
pup
puzzled
rode
sad
screwed
shocking
shook
sizes
soft
square
staring
stole
surprise
sweet
tall
trickle
tweeted
uneven
waking
wheels
windows
abilities
bicameral
boom
boost
broken_tax_code
child_tax_credit
delighted
doubles
earnings
enterprise
enterprise_system
envy
extends
filing
gauge
healthcare_bill
hiring
improvement
industrialized
industrialized_world
invented
jobs_act
keys
llcs
lowers
middle-
production
progrowth
reduces
reinvest
relying
respective
reverse
simplifies
stock
stock_market
strand
succeeds
systemic
systemic_risk
trillions
united_states_of_america
unleash
unleashing
vitality
wages
average_american
begins
blunder
booming
breath
broken_promises
chris_collins
competitor
complicated
covering
crafted
customary
customary_30_minutes
dismantling
eliminated
ended
expecting
expire
fantasy
favorable
favored
geared
giveaway
guise
individual_market
insult
investing
kansas
limiting
liquid
lobbying
low-income_students
mightily
mongering
mortgage
mortgage_interest_deduction
outright
perkins
persons
reauthorizing
reforming
registered
renewing
richard_neal
secured
skills_gap
speaks
steadily
steady
swamp
systematic
tackle
unemployment
unemployment_rate
unfilled
walking
arbitrary
barney
barney_frank
calculation
complexity
conceived
disruption
financial_institutions
financial_services_committee
financial_system
framework
holding
holding_companies
implications
incredible_work
inefficient
manage
regulator
regulatory_framework
sifi
simplicity
slated
supervision
systemically
treasury_secretary
yellen
caribbean
commute
dime
disguised
dodgers
exported
fraud
fraudulent
hidden
loophole
pennies
wretched
clothing
dad
impediment
motors
opponents
proudly
restaurant
salvation
salvation_army
undoubtedly
affordable_coverage
essence
grandkids
lump
medical_research
pool
rip
superrich
bricks
dominate
earning
guarantee
holidays
identity
incredible_opportunity
investor
labored
libertarian
mail
mortar
pole
take-home_pay
tone
abandoned
billionaire
conclude
kentucky
massive_cuts
unpopular
wealthy_corporations
armageddon
chase
cusp
hardworking_people
hyperbole
lengths
leveled
simplified
street_businesses
accounts
bunch
concentrate
fargo
opened
wells
wells_fargo
believes
delivering
expiration
median
nonetheless
referring
sessions
sunset
billionaires
californians
cruel
easier
healthcare_coverage
horse
millionaires
pipe
raw_deal
revealed
ruthless
selling
shattering
slap
steals
tremendous_leadership
balloons
competitiveness
crumbs
negotiation
philosophy
repeals
wasted
aptly
chip
chronicle
commuters
distribution
houston_chronicle
losers
winners
infrastructure_plan
multinational
multinational_corporations
reinvesting
simplify
stagnant
unconscionable
1980s
hardworking_americans
historic_bill
arms
bet
comrades
eligible
feared
finger
low-income_families
military_families
orrin
richest_1_percent
rigging
rising_costs
shuts
ugly
vacations
wage_workers
wanting
wealthiest_people
affirmative
answering
graduate_students
productive
proudest
appalled
barton
disastrous
kid
lectures
poor_people
economics
good-paying_jobs
senses
trickle-down_economics
worrying
deadline
disaster_funding
disaster_relief
errors
lined
margins
offering
onerous
prohibited
riddled
secretive
separate_bill
articulate
causing
diligence
downturn
friendly
locations
mike_kelly
offshore
raided
stamp
taxed
thoughtfully
tired
viewpoint
woodall
abandons
accurately
adapted
alternative_minimum_tax
amt
astronomical
betray
betrayal
borrowers
bubble
burst
busy
championing
checkbook
child_care
cling
compels
continental_united_states
dearly
depriving
devastation
digital
drowning
earners
eliminate
endowment
evaluating
exceeding
fellowships
fewer_americans
foreclosure
fors
harvey
heartless
heavily
holes
humanities
hurricane_harvey
inexplicably
insurance_coverage
interconnected
jeopardizes
landfall
lifts
lone_star_state
loop
massive_tax_cut
massive_tax_cuts
mechanisms
middle-class_families
misery
monstrous
mortgage_interest
needy
nursery
ordinary
ordinary_americans
phony
positioned
realizing
reaping
recover
resting
retraining
rewarded
schedules
scheme
scientific_research
sees
slash
stealing
super
surprising
taxable
taxing
tele
tens_of_millions
tenth
universe
unyielding
wholesale
bedrock
decisively
devastating_impact
discriminatory
extension
granting
historic_opportunity
hurricanes_irma
inequities
normalcy
puerto_rico
sustainable
unprecedented
zones
advisory
advisory_committee
combating
driver
empowers
esty
katko
license
prevention
advise
concrete_steps
convene
dot
egregious
flexibility
fmcsa
hotline
identical
identical_bill
abused
average_age
coauthor
coauthored
designates
ears
empowering
enters
forms
infrastructure_committee
inhumane
john_katko
klobuchar
occurring
operator
ring
sexually
shockingly
signature
socioeconomic_status
stem
swift
teen
thune
tide
vehicle
exploits
inexcusable
metro
norton
shipping
transportation_system
aguilar
approves
certify
commonsense_changes
expanded
licenses
medical_professionals
pete
qualifying
testing
assistants
certification
certified
civilian_life
examinations
examiners
expires
fast_act
finalized
physician_assistants
practitioners
registry
remedy
reservists
restricts
significant_number
trained
wheel
brownley
certifications
graves
julia
julia_brownley
licensed
va_system
active-duty_servicemembers
brave_servicemembers
commonsense_legislation
gained
guardsmen
guiding
heroes_act
military_service
reentering
seamless
tillis
warren
100th
100th_anniversary
carlos
empowered
periods
remained
renowned
actors
commercially
convicted
criminal_penalties
incumbent
knowingly
lifetime
negligent
penalties
san_antonio
trafficked
vigilant
weed
ban
coerced
committing
exploited
forced_labor
heinous_acts
indentured
institutes
missing
operative
perpetrators
reminder
servitude
stark
stark_reminder
voice_vote
walmart
horrors
innocent_people
instances
location
stopping
strengthens
truck_drivers
accompany
filers
lowered
penalty
student_loan
briefly
clothes
duck
humbled
servants
tommy
toys
wyatt
corporate_interests
disappointment
inclusive
ultrawealthy
choice
deliver
hardworking_families
prop
sweeping
calamity
collapsed
debacle
deficit_spending
tally
visited
battlefields
charity
crown
enthusiasts
heritage
jewels
private_funds
